joeyp2k/Cuitt-NRF/Desktop/Engineering/Cuitt/Development/nRF5_SDK_17.0.0_9d13099/examples/ble_peripheral/ble_app_buttonless_dfu/main.c
static uint16_t m_conn_handle = BLE_CONN_HANDLE_INVALID;                            /**< Handle of the current connection. */
static void advertising_start(bool erase_bonds);                                    /**< Forward declaration of advertising start function */

#define BUTTON_DETECTION_DELAY          APP_TIMER_TICKS(50)   

// YOUR_JOB: Use UUIDs for service(s) used in your application.
static ble_uuid_t m_adv_uuids[] = {{CUSTOM_SERVICE_UUID, BLE_UUID_TYPE_VENDOR_BEGIN}};
//static ble_uuid_t m_adv_uuids[] = {{BLE_UUID_DEVICE_INFORMATION_SERVICE, BLE_UUID_TYPE_BLE}};

//global variables
bool connected = false;

unsigned char daynum = 0;//day index
unsigned char weeknum = 1;//week index
volatile unsigned int click = 0;//click counter for BLE pairing
uint16_t Draw_length = 0;//the length of time of the draw
uint16_t Draw_length_last;
uint16_t Draw_length_average_3 = 0;//the average time taking the last 3 draws
uint16_t Draw_length_average = 0;//the average time taking a draw
uint16_t Draw_length_average_t = 0;//the average time taking a draw today (used for total average)
unsigned char Buffer = 100;//the current buffer for draws taken in close intervals
unsigned char T = 1;//the max draws that can be taken before the session counter incrementns for draws taken in close intervals: estimated from average hits taken in 3 hour intervals
unsigned int DCT = 0;//the amount of draws taken
unsigned int SCT = 0;//the amount of sessions
unsigned int SCT_average = 0;//daily sessions average
unsigned int DCT_average = 0;//daily count average
uint16_t Draw_length_total = 0;//todays total time taking draws
uint16_t DLT_average = 0;//the average total time taking draws each daysigned int DL_average = 0;//average draw time taking a draw
uint32_t Time_between = 0;//time between sessions
uint32_t Time_between_average_3 = 0;//average time between last three sessions
uint32_t Time_between_average = 0;//average time between sessions
uint32_t Time_between_t = 0;
uint32_t Wait_period;// = 16/SCT_average;//calculated wait period between seshes to make progress
unsigned int Over_count;//the amount of hits taken after today's draw total surpasses the draw length total average
unsigned int Relapse_code;//whether the user is relapsing or not (1 or 0)
unsigned int Suggestion;//the suggested draw length
unsigned int Relapse_count;//the amount of hits taken with a negative progress code
unsigned int Progress_count;//the amount of hits taken with a positive progress code
unsigned int Progress_code;//qualitative value determining how much the user is progressing
unsigned int Progress;//whether positive, negative, or neutral
unsigned int Prog_ranking;//the ranking of the hit length or wait period in successfully making progress towards the user's goal
float Decay = 0.95;//the seconds the user is expected to reduce their average draw length by
unsigned int Session_interval = 500;//interval after hit for session count increment: if weed setting, 2*60*60 and if nicotine setting, 1
unsigned int Three_average_array[3][2] = {0};
bool voltage_lock = false;
bool auto_lock = false;
unsigned int Calculation_array[7][5] = {0};
unsigned char z;
volatile unsigned int dc = 0;//milliseconds
volatile unsigned char Button = 0;//button pressed value
volatile unsigned char Button_b = 0;//button pressed value b

uint8_t tx_data[8] = {0x00};

#define DRAW_BUTTON                BSP_BUTTON_0    
#define STATBUTTON_BUTTON          BSP_BUTTON_1  

/**@brief Handler for shutdown preparation.
 *
 * @details During shutdown procedures, this function will be called at a 1 second interval
 *          untill the function returns true. When the function returns true, it means that the
 *          app is ready to reset to DFU mode.
 *
 * @param[in]   event   Power manager event.
 *
 * @retval  True if shutdown is allowed by this power manager handler, otherwise false.
 */
static bool app_shutdown_handler(nrf_pwr_mgmt_evt_t event)
{
    switch (event)
    {
        case NRF_PWR_MGMT_EVT_PREPARE_DFU:
            NRF_LOG_INFO("Power management wants to reset to DFU mode.");
            // YOUR_JOB: Get ready to reset into DFU mode
            //
            // If you aren't finished with any ongoing tasks, return "false" to
            // signal to the system that reset is impossible at this stage.
            //
            // Here is an example using a variable to delay resetting the device.
            //
            // if (!m_ready_for_reset)
            // {
            //      return false;
            // }
            // else
            //{
            //
            //    // Device ready to enter
            //    uint32_t err_code;
            //    err_code = sd_softdevice_disable();
            //    APP_ERROR_CHECK(err_code);
            //    err_code = app_timer_stop_all();
            //    APP_ERROR_CHECK(err_code);
            //}
            break;

        default:
            // YOUR_JOB: Implement any of the other events available from the power management module:
            //      -NRF_PWR_MGMT_EVT_PREPARE_SYSOFF
            //      -NRF_PWR_MGMT_EVT_PREPARE_WAKEUP
            //      -NRF_PWR_MGMT_EVT_PREPARE_RESET
            return true;
    }

    NRF_LOG_INFO("Power management allowed to reset to DFU mode.");
    return true;
}

//lint -esym(528, m_app_shutdown_handler)
/**@brief Register application shutdown handler with priority 0.
 */
NRF_PWR_MGMT_HANDLER_REGISTER(app_shutdown_handler, 0);


static void buttonless_dfu_sdh_state_observer(nrf_sdh_state_evt_t state, void * p_context)
{
    if (state == NRF_SDH_EVT_STATE_DISABLED)
    {
        // Softdevice was disabled before going into reset. Inform bootloader to skip CRC on next boot.
        nrf_power_gpregret2_set(BOOTLOADER_DFU_SKIP_CRC);

        //Go to system off.
        nrf_pwr_mgmt_shutdown(NRF_PWR_MGMT_SHUTDOWN_GOTO_SYSOFF);
    }
}

/* nrf_sdh state observer. */
NRF_SDH_STATE_OBSERVER(m_buttonless_dfu_state_obs, 0) =
{
    .handler = buttonless_dfu_sdh_state_observer,
};


static void advertising_config_get(ble_adv_modes_config_t * p_config)
{
    memset(p_config, 0, sizeof(ble_adv_modes_config_t));

    p_config->ble_adv_fast_enabled  = true;
    p_config->ble_adv_fast_interval = APP_ADV_INTERVAL;
    p_config->ble_adv_fast_timeout  = APP_ADV_DURATION;
}


static void disconnect(uint16_t conn_handle, void * p_context)
{
    UNUSED_PARAMETER(p_context);

