joeyp2k/Cuitt-NRF/Desktop/Engineering/Cuitt/Development/nRF5_SDK_17.0.0_9d13099/examples/ble_peripheral/ble_app_buttonless_dfu/main.c
    NRF_SDH_BLE_OBSERVER(m_ble_observer, APP_BLE_OBSERVER_PRIO, ble_evt_handler, NULL);
}


/**@brief Function for the Peer Manager initialization.
 */
static void peer_manager_init()
{
    ble_gap_sec_params_t sec_param;
    ret_code_t           err_code;

    err_code = pm_init();
    APP_ERROR_CHECK(err_code);

    memset(&sec_param, 0, sizeof(ble_gap_sec_params_t));

    // Security parameters to be used for all security procedures.
    sec_param.bond           = SEC_PARAM_BOND;
    sec_param.mitm           = SEC_PARAM_MITM;
    sec_param.lesc           = SEC_PARAM_LESC;
    sec_param.keypress       = SEC_PARAM_KEYPRESS;
    sec_param.io_caps        = SEC_PARAM_IO_CAPABILITIES;
    sec_param.oob            = SEC_PARAM_OOB;
    sec_param.min_key_size   = SEC_PARAM_MIN_KEY_SIZE;
    sec_param.max_key_size   = SEC_PARAM_MAX_KEY_SIZE;
    sec_param.kdist_own.enc  = 1;
    sec_param.kdist_own.id   = 1;
    sec_param.kdist_peer.enc = 1;
    sec_param.kdist_peer.id  = 1;

    err_code = pm_sec_params_set(&sec_param);
    APP_ERROR_CHECK(err_code);

    err_code = pm_register(pm_evt_handler);
    APP_ERROR_CHECK(err_code);
}


/** @brief Clear bonding information from persistent storage.
 */
static void delete_bonds(void)
{
    ret_code_t err_code;

    NRF_LOG_INFO("Erase bonds!");

    err_code = pm_peers_delete();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling events from the BSP module.
 *
 * @param[in]   event   Event generated when button is pressed.
 */

static void bsp_event_handler(bsp_event_t event)
{
    uint32_t err_code;
    if(connected == false){ 
        switch (event)
        {
            case BSP_EVENT_SLEEP:
                NRF_LOG_INFO("SLEEP");
                sleep_mode_enter();
                break; // BSP_EVENT_SLEEP

            case BSP_EVENT_DISCONNECT:
                NRF_LOG_INFO("DISCONNECT");
                err_code = sd_ble_gap_disconnect(m_conn_handle,
                                                 BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
                if (err_code != NRF_ERROR_INVALID_STATE)
                {
                    APP_ERROR_CHECK(err_code);
                }
                break; // BSP_EVENT_DISCONNECT

            case BSP_EVENT_WHITELIST_OFF:
                NRF_LOG_INFO("RESET");
                if (m_conn_handle == BLE_CONN_HANDLE_INVALID)
                {
                    err_code = ble_advertising_restart_without_whitelist(&m_advertising);
                    if (err_code != NRF_ERROR_INVALID_STATE)
                    {
                        APP_ERROR_CHECK(err_code);
                    }
                }
                break; // BSP_EVENT_KEY_0

            default:
             NRF_LOG_INFO("DEFAULT");
                break;
        }
    }
    /*
    else{
        switch (event)
            {
                case BSP_EVENT_SLEEP:
                    NRF_LOG_INFO("SLEEP");
                    break; // BSP_EVENT_SLEEP

                case BSP_EVENT_DISCONNECT:
                    NRF_LOG_INFO("DISCONNECT");
                    break; // BSP_EVENT_DISCONNECT

                case BSP_EVENT_WHITELIST_OFF:
                    NRF_LOG_INFO("RESET");
                    break; // BSP_EVENT_KEY_0

                default:
                 NRF_LOG_INFO("DEFAULT");
                    break;
            }
        }
        */
}

const nrf_drv_twi_t twi = NRF_DRV_TWI_INSTANCE(1);

void twi_init (void)
{
    ret_code_t err_code;

    const nrf_drv_twi_config_t twi_rtc_config = {
       .scl                = ARDUINO_SCL_PIN,
       .sda                = ARDUINO_SDA_PIN,
       .frequency          = NRF_DRV_TWI_FREQ_100K,
       .interrupt_priority = APP_IRQ_PRIORITY_HIGH,
       .clear_bus_init     = false
    };

    err_code = nrf_drv_twi_init(&twi, &twi_rtc_config, NULL, NULL);
    APP_ERROR_CHECK(err_code);

    nrf_drv_twi_enable(&twi);
}

uint32_t current_time = 0;
uint32_t current_time_b;

//Convert BCD in the real time clock to decimal
uint8_t bcdToDec(uint8_t val)
{ 
    return( (val/16*10) + (val%16) );
}
static void button_event_handler(uint8_t pin_no, uint8_t button_action)
{
    ret_code_t err_code;
    uint8_t arr[14];

    switch (pin_no)
    {
        case DRAW_BUTTON:
            NRF_LOG_INFO("Send button state change.");
            Button = 1 - Button;
            printf("Button: %d\n", Button);
            if(Button == 1){
                nrf_drv_rtc_enable(&rtc);
                nrf_drv_rtc_tick_enable(&rtc, true);
                z = 0;
                //take current time
                
                uint8_t addr[1] = {0x00};
                err_code = nrf_drv_twi_tx(&twi, RTC_ADDRESS, addr, 1, false);
                APP_ERROR_CHECK(err_code);
                err_code = nrf_drv_twi_rx(&twi, RTC_ADDRESS, tx_data, sizeof(tx_data));
                APP_ERROR_CHECK(err_code);
                for(uint32_t i = 0; i <= 6; i++){
                    tx_data[i] = bcdToDec(tx_data[i]);
                    printf("0x%02x %d\n", i, tx_data[i]);
                }
                current_time = tx_data[0]+tx_data[1]*60+tx_data[2]*60*60+tx_data[3]*24*60*60;
                if(Time_between >= Session_interval){
                    if(Buffer == T){
                        Buffer = 0;
                        DCT++;
                        SCT++;
                    }
                    else{
                        DCT++;
                        Buffer++;
                    }
                }
                else
                {
                    DCT++;
                    SCT++;
                }
            }
            else{
                nrf_drv_rtc_disable(&rtc);
                nrf_drv_rtc_tick_disable(&rtc);
                //negate count for miniscule draws to maintain integrity of suggestion
                if(Draw_length < 400){
                DCT--;
                SCT--;
                }
                //take current time
                
                uint8_t addr[1] = {0x00};
                err_code = nrf_drv_twi_tx(&twi, RTC_ADDRESS, addr, 1, false);
                APP_ERROR_CHECK(err_code);
                err_code = nrf_drv_twi_rx(&twi, RTC_ADDRESS, tx_data, sizeof(tx_data));
                APP_ERROR_CHECK(err_code);
                for(uint32_t i = 0; i <= 6; i++){
                    tx_data[i] = bcdToDec(tx_data[i]);
                    printf("0x%02x %d\n", i, tx_data[i]);
                }
                current_time = tx_data[0]+tx_data[1]*60+tx_data[2]*60*60+tx_data[3]*24*60*60;
                //compare with last time taken
                if(current_time_b == 0){
                    Time_between = 0;
                }else{
                    Time_between = current_time - current_time_b;
                }
                printf("Time 1: %lu\n",current_time);
                printf("Time 2: %lu\n",current_time_b);
                printf("Time Between: %lu\n",Time_between);
                current_time_b = current_time;
                bsp_board_led_off(RED_LED);
                bsp_board_led_off(BLUE_LED);
                bsp_board_led_off(GREEN_LED);

                static signed char c = -1;
                static unsigned char a = 0;//three count index
                if(c == 2){
                    //do nothing
                }
                else
                {
                    c++;
                }
                if(a == 3){
                a = 0;
                }

                Draw_length_total += Draw_length;

                Calculation_array[daynum][0] = Draw_length_total;
                DLT_average = 0;
                for(char i = 0; i <= daynum; i++){
                    DLT_average += Calculation_array[i][0];
                }
                DLT_average /= (daynum + 1);

                Three_average_array[a][0] = Draw_length;
                Draw_length_average_3 = 0;
                for(char i = 0; i <= c; i++){
                    Draw_length_average_3 += Three_average_array[i][0];
                }
                Draw_length_average_3 /= (c + 1);

                Three_average_array[a][1] = Time_between;
                Time_between_average_3 = 0;
                for(int i = 0; i <= c; i++){
                    Time_between_average_3 += Three_average_array[i][1];
                }
                Time_between_average_3 /= (c + 1);

                a++;

