joeyp2k/Cuitt-NRF/Desktop/Engineering/Cuitt/Development/nRF5_SDK_17.0.0_9d13099/examples/ble_peripheral/ble_app_buttonless_dfu/main.c
                Calculation_array[daynum][1] = SCT;
                SCT_average = 0;
                for(char i = 0; i <= daynum; i++){
                    SCT_average += Calculation_array[i][1];
                }
                SCT_average /= (daynum + 1);

                Calculation_array[daynum][2] = DCT;
                DCT_average = 0;
                for(char i = 0; i <= daynum; i++){
                    DCT_average += Calculation_array[i][2];
                }
                DCT_average /= (daynum + 1);

                Draw_length_average_t += Draw_length;

                Calculation_array[daynum][3] = Draw_length_average_t;
                Draw_length_average_t = 0;
                for(char i = 0; i <= daynum; i++){
                    Draw_length_average_t += Calculation_array[i][3];
                }
                Draw_length_average = Draw_length_average_t/DCT;

                Time_between_t += Time_between;

                Calculation_array[daynum][4] = Time_between_t;
                Time_between_t = 0;
                for(char i = 0; i <= daynum; i++){
                    Time_between_t += Calculation_array[i][4];
                }
                Time_between_average = Time_between_t/SCT;

                Wait_period = 16/SCT_average;
    
                Suggestion = DLT_average/DCT_average * Decay;//FIX SUGGESITON TOO SMALL
                
                printf("Draw length for this draw: %d\n", Draw_length);
                printf("Current time: %d\n", current_time);
                /*
                printf("Draws today: %d\n", DCT);
                printf("Sessions today: %d\n", SCT);
                printf("Draw length for this draw: %d\n", Draw_length);
                printf("Draw length total for today: %d\n", Draw_length_total);
                printf("Time between this draw and the last: %d\n", Time_between);
                printf("Average amount of sesions a day: %d\n", SCT_average);
                printf("Average amount of draws a day: %d\n", DCT_average);
                printf("Average draw length for individual draws: %d\n", Draw_length_average);
                printf("Average length of the last three draws: %d\n", Draw_length_average_3);
                printf("Average draw length total for all days: %d\n", DLT_average);
                printf("Average time between the past three draws: %d\n", Time_between_average_3);
                printf("Average time between draws: %d\n", Time_between_average);
                printf("Suggested wait period between draws: %d\n", Wait_period);
                printf("Suggested draw length: %d\n", Suggestion);
                */
                arr[0] = current_time >> 24;
                arr[1] = current_time >> 16;
                arr[2] = current_time >> 8;
                arr[3] = current_time;

                arr[4] = Draw_length >> 8;
                arr[5] = Draw_length;

                arr[6] = DCT >> 8;
                arr[7] = DCT;

                arr[8] = SCT >> 8;
                arr[9] = SCT;

                dc = 0;
                Draw_length = 0;

                printf("__________BLE transmit attempt___________\n");
                if(connected == true){
                    err_code = ble_lbs_on_button_change(m_conn_handle, &m_cus, arr);
                    printf("BLE transmit complete\n");
                    if (err_code != NRF_SUCCESS &&
                    err_code != BLE_ERROR_INVALID_CONN_HANDLE &&
                    err_code != NRF_ERROR_INVALID_STATE &&
                    err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)
                    {
                        APP_ERROR_CHECK(err_code);
                    }
                }
                else{
                    printf("Store to stack");
                    //store to stack
                }
            }            
            break;
        case STATBUTTON_BUTTON:
            Button_b = 1 - Button_b;
            printf("Button B: %d\n", Button_b);
            nrf_drv_rtc_enable(&rtc);
            nrf_drv_rtc_tick_enable(&rtc,true);
            //Current_time();
            while(dc <= 3000){
                if(Draw_length_total >= DLT_average){
                    bsp_board_led_on(RED_LED);
                }
                else if(Time_between <= Wait_period){
                    bsp_board_led_on(RED_LED);
                }
                else{
                    bsp_board_led_on(BLUE_LED);
                }
            }
            bsp_board_led_off(RED_LED);
            bsp_board_led_off(BLUE_LED);
            bsp_board_led_off(GREEN_LED);
            nrf_drv_rtc_disable(&rtc);
            nrf_drv_rtc_tick_disable(&rtc);
            dc = 0;
            break;
        default:
            APP_ERROR_HANDLER(pin_no);
            break;
    }
}


static void rtc_handler(nrf_drv_rtc_int_type_t int_type)
{
    if (int_type == NRF_DRV_RTC_INT_TICK)
    {
        dc = dc + 100;
        printf("tick: %d\n",dc);
    }
    if(Button == 1){
        Draw_length = dc;
        printf("Draw Length: %dms\n", Draw_length);
        if(Draw_length_total >= DLT_average){
            printf("Exceeding today's total\n");
            bsp_board_led_on(RED_LED);
            if(voltage_lock = 1){
                //Lock voltage
                printf("Voltage Lock Enabled\n");
            }
        }else if(Time_between <= Wait_period){
            printf("Wait longer to take a hit\n");
            bsp_board_led_on(RED_LED);
            if(voltage_lock = 1){
                //Lock voltage
                printf("Voltage Lock Enabled\n");
            }
        }else if(Draw_length >= Suggestion - 3){
            printf("Stop Suggested\n");
            bsp_board_led_on(BLUE_LED);
            if(auto_lock = 1){
                if(Draw_length >= Suggestion){
                    printf("Auto Suggestion Lock Enabled\n");
                    //Lock voltage
                    bsp_board_led_off(BLUE_LED);
                    bsp_board_led_on(RED_LED);
                }
            }
            else if(Draw_length >= Draw_length_average){
                printf("Draw length longer than average\n");
                bsp_board_led_off(BLUE_LED);
                bsp_board_led_on(RED_LED);
                if(voltage_lock = 1){
                    //Lock voltage
                    printf("Voltage Lock Enabled\n");
                }
            }
        }
    }
}

static void lfclk_config(void)
{
    ret_code_t err_code = nrf_drv_clock_init();
    APP_ERROR_CHECK(err_code);

    nrf_drv_clock_lfclk_request(NULL);
}

